#+TITLE: Editing skills

I defined the key bindings like this


提高编辑效率，善于normal模式快捷键。

* evil-surround
v  "S"  #'evil-surround-region
o  "s"  #'evil-surround-edit
o  "S"  #'evil-Surround-edit

* expand-region
v  "v"  #'er/expand-region
v  "V"  #'er/contract-region

v  "R"  #'select-all-match
v  "S"  #'evil-surround-region


So in =view= mode, you can use =v= to expand select the word or sentence or
paragraph or expand it then =S= to surround the word
or use =R= to select all matched word

* Chinese character display issue

原来在windows下显示中文异常是因为重装系统后，没有相应的字体。无语。。。

#+BEGIN_SRC emacs-lisp
(if IS-WINDOWS
	(setq
    doom-font (font-spec :family "Hack" :size 16)
    doom-big-font (font-spec :family "Hack" :size 18)
		doom-variable-pitch-font (font-spec :family "Yahei Consolas Hybrid" :size 16)
		doom-unicode-font (font-spec :family "Yahei Consolas Hybrid" :size 16))
	(setq
    doom-font (font-spec :family "Fira Code" :size 16)
    doom-big-font (font-spec :family "Fira Code" :size 18)
		doom-variable-pitch-font (font-spec :family "Fira Code" :size 16)
		doom-unicode-font (font-spec :family "Fira Code" :size 16)))
#+END_SRC

#+RESULTS:
: #<font-spec nil nil Yahei\ Consolas\ Hybrid nil nil nil nil nil 16 nil nil nil nil>

#+BEGIN_SRC emacs-lisp
(setq set-frame-font (font-spec :family "Yahei Consolas Hybrid" :size 16))
#+END_SRC

#+RESULTS:
: #<font-spec nil nil Yahei\ Consolas\ Hybrid nil nil nil nil nil 16 nil nil nil nil>
